---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions.AddHolesForTaps
source: html/5ada3cdc-d6c5-9260-68f8-cf6267604038.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions.AddHolesForTaps Property

Set true to have holes for taps on straights added to the created fabrication job.

## Syntax (C#)
```csharp
public bool AddHolesForTaps { get; set; }
```